---
kind: type
id: T:Autodesk.Revit.DB.LeaderShape
source: html/116cbc39-8db2-b375-a42f-a6bf3c73df68.htm
---
# Autodesk.Revit.DB.LeaderShape

Supported geometric shapes of annotation leaders.

## Syntax (C#)
```csharp
public enum LeaderShape
```

## Remarks
Although the Leader class supports
 all available shapes, not all types of leaders may have the option to
 change its shape. For example, leaders of text annotations can be of
 any shape, while leaders of level lines are never curved.